In [1]:

# Dependencies
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import Column, Integer, String, Float
import datetime as date

### Extract and format data

In [2]:
# Save data from path in new variable
youngToElder = "data/size-of-young-working-elderly-populations.csv"

# Use Pandas to read female data
ytf_df = pd.read_csv(youngToElder)
ytf_df = ytf_df[ytf_df['Code'] == 'USA']
ytf_df

,Entity,Code,Year,Young (<15 years),Working age (15-64 years),Elderly (65+ years)
14850,United States,USA,1950,42595725.0,103165892.0,13042778.0
14851,United States,USA,1951,43992346.0,103470364.0,13442325.0
14852,United States,USA,1952,45434413.0,104040908.0,13849530.0
14853,United States,USA,1953,47010674.0,104719684.0,14257832.0
14854,United States,USA,1954,48705232.0,105454218.0,14668163.0
...,...,...,...,...,...,...
14911,United States,USA,2011,62174432.0,207685896.0,41191045.0
14912,United States,USA,2012,61980690.0,208876587.0,42478146.0
14913,United States,USA,2013,61755723.0,209910430.0,43870523.0
14914,United States,USA,2014,61570949.0,210817851.0,45329979.0
14915,United States,USA,2015,61467543.0,211622891.0,46838728.0

In [3]:
# rename the columns
clean_ytf_df = ytf_df.rename(columns={'Year':'year','Entity':'country','Young (<15 years)':'young','Working age (15-64 years)':'working_age',
                                      'Elderly (65+ years)':'elder'})

# new df columns 
new_ytf_df = clean_ytf_df[['country','year','young','working_age','elder']]
new_ytf_df

             country  year       young  working_age       elder
14850  United States  1950  42595725.0  103165892.0  13042778.0
14851  United States  1951  43992346.0  103470364.0  13442325.0
14852  United States  1952  45434413.0  104040908.0  13849530.0
14853  United States  1953  47010674.0  104719684.0  14257832.0
14854  United States  1954  48705232.0  105454218.0  14668163.0
...              ...   ...         ...          ...         ...
14911  United States  2011  62174432.0  207685896.0  41191045.0
14912  United States  2012  61980690.0  208876587.0  42478146.0
14913  United States  2013  61755723.0  209910430.0  43870523.0
14914  United States  2014  61570949.0  210817851.0  45329979.0
14915  United States  2015  61467543.0  211622891.0  46838728.0

[66 rows x 5 columns]

In [4]:
# change data types
new_ytf_df['young'] = new_ytf_df['young'].round().astype('int')
new_ytf_df['working_age'] = new_ytf_df['working_age'].round().astype('int')
new_ytf_df['elder'] = new_ytf_df['elder'].round().astype('int')

new_ytf_df

/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

             country  year     young  working_age     elder
14850  United States  1950  42595725    103165892  13042778
14851  United States  1951  43992346    103470364  13442325
14852  United States  1952  45434413    104040908  13849530
14853  United States  1953  47010674    104719684  14257832
14854  United States  1954  48705232    105454218  14668163
...              ...   ...       ...          ...       ...
14911  United States  2011  62174432    207685896  41191045
14912  United States  2012  61980690    208876587  42478146
14913  United States  2013  61755723    209910430  43870523
14914  United States  2014  61570949    210817851  45329979
14915  United States  2015  61467543    211622891  46838728

[66 rows x 5 columns]

## Database creation

### Create the database connection then load data from the dataframe

In [5]:
from config import username, password

engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/Population')

In [ ]:
new_ytf_df.to_sql(name='young_to_elder', con=engine, if_exists='append', index=True)